## Question 22

+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| id            | int     |
| recordDate    | date    |
| temperature   | int     |
+---------------+---------+
id is the column with unique values for this table.
This table contains information about the temperature on a certain day.

In [2]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%%sql
CREATE TABLE IF NOT EXISTS Weather (
    ID INT,
    recordDate DATE,
    Temperature INT
);

 * sqlite://
Done.

[]

In [4]:
%%sql

INSERT INTO Weather (ID, recordDate, Temperature)
VALUES
    (1, '2015-01-01', 10),
    (2, '2015-01-02', 25),
    (3, '2015-01-03', 20),
    (4, '2015-01-04', 30);

 * sqlite://
4 rows affected.

[]

In [6]:
%%sql
SELECT * FROM weather

 * sqlite://
Done.

[(1, '2015-01-01', 10),
 (2, '2015-01-02', 25),
 (3, '2015-01-03', 20),
 (4, '2015-01-04', 30)]

In [5]:
%%sql
SELECT w1.id
FROM Weather w1
JOIN Weather w2 ON w1.recordDate = date(w2.recordDate, '+1 day')
WHERE w1.Temperature > w2.Temperature

 * sqlite://
Done.

[(2,), (4,)]